test/test.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://server.soap.zvezdochet.kz/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:calculate>
         <!--Optional:-->
         <arg0>2012</arg0>
         <!--Optional:-->
         <arg1>9</arg1>
         <!--Optional:-->
         <arg2>16</arg2>
         <!--Optional:-->
         <arg3>0</arg3>
         <!--Optional:-->
         <arg4>28</arg4>
         <!--Optional:-->
         <arg5>41</arg5>
         <!--Optional:-->
         <arg6>6</arg6>
         <!--Optional:-->
         <arg7>43</arg7>
         <!--Optional:-->
         <arg8>76</arg8>
         <!--Optional:-->
         <arg9>P</arg9>
      </ser:calculate>
   </soapenv:Body>
</soapenv:Envelope>
